openweave/openweave-nrf52840-lock-example/main/AppTask.cpp
            NRF_LOG_INFO("Factory Reset has been Canceled");
        }
    }
}

void AppTask::CancelTimer()
{
    ret_code_t ret;

    ret = app_timer_stop(sFunctionTimer);
    if (ret != NRF_SUCCESS)
    {
        NRF_LOG_INFO("app_timer_stop() failed");
        APP_ERROR_HANDLER(ret);
    }

    mFunctionTimerActive = false;
}

void AppTask::StartTimer(uint32_t aTimeoutInMs)
{
    ret_code_t ret;

    ret = app_timer_start(sFunctionTimer, pdMS_TO_TICKS(aTimeoutInMs), this);
    if (ret != NRF_SUCCESS)
    {
        NRF_LOG_INFO("app_timer_start() failed");
        APP_ERROR_HANDLER(ret);
    }

    mFunctionTimerActive = true;
}

void AppTask::ActionInitiated(BoltLockManager::Action_t aAction, int32_t aActor)
{
    // If the action has been initiated by the lock, update the bolt lock trait
    // and start flashing the LEDs rapidly to indicate action initiation.
    if (aAction == BoltLockManager::LOCK_ACTION)
    {
        WdmFeature().GetBoltLockTraitDataSource().InitiateLock(aActor);
        NRF_LOG_INFO("Lock Action has been initiated")
    }
    else if (aAction == BoltLockManager::UNLOCK_ACTION)
    {
        WdmFeature().GetBoltLockTraitDataSource().InitiateUnlock(aActor);
        NRF_LOG_INFO("Unlock Action has been initiated")
    }

    sLockLED.Blink(50, 50);
}

void AppTask::ActionCompleted(BoltLockManager::Action_t aAction)
{
    // if the action has been completed by the lock, update the bolt lock trait.
    // Turn on the lock LED if in a LOCKED state OR
    // Turn off the lock LED if in an UNLOCKED state.
    if (aAction == BoltLockManager::LOCK_ACTION)
    {
        NRF_LOG_INFO("Lock Action has been completed")

        WdmFeature().GetBoltLockTraitDataSource().LockingSuccessful();

        sLockLED.Set(true);
    }
    else if (aAction == BoltLockManager::UNLOCK_ACTION)
    {
        NRF_LOG_INFO("Unlock Action has been completed")

        WdmFeature().GetBoltLockTraitDataSource().UnlockingSuccessful();

        sLockLED.Set(false);
    }
}

void AppTask::PostLockActionRequest(int32_t aActor, BoltLockManager::Action_t aAction)
{
    AppEvent event;
    event.Type             = AppEvent::kEventType_Lock;
    event.LockEvent.Actor  = aActor;
    event.LockEvent.Action = aAction;
    event.Handler          = LockActionEventHandler;
    PostEvent(&event);
}

void AppTask::PostEvent(const AppEvent * aEvent)
{
    if (sAppEventQueue != NULL)
    {
        if (!xQueueSend(sAppEventQueue, aEvent, 1))
        {
            NRF_LOG_INFO("Failed to post event to app task event queue");
        }
    }
}

void AppTask::DispatchEvent(AppEvent * aEvent)
{
    if (aEvent->Handler)
    {
        aEvent->Handler(aEvent);
    }
    else
    {
        NRF_LOG_INFO("Event received with no handler. Dropping event.");
    }
}

void AppTask::InstallEventHandler(AppEvent * aEvent)
{
    SoftwareUpdateMgr().ImageInstallComplete(WEAVE_NO_ERROR);
}

void AppTask::HandleSoftwareUpdateEvent(void *apAppState,
                                        SoftwareUpdateManager::EventType aEvent,
                                        const SoftwareUpdateManager::InEventParam& aInParam,
                                        SoftwareUpdateManager::OutEventParam& aOutParam)
{
    static uint64_t numBytesDownloaded = 0;

    switch(aEvent)
    {
        case SoftwareUpdateManager::kEvent_PrepareQuery:
        {
            aOutParam.PrepareQuery.PackageSpecification = NULL;
            aOutParam.PrepareQuery.DesiredLocale = NULL;
            break;
        }

        case SoftwareUpdateManager::kEvent_PrepareQuery_Metadata:
        {
            WEAVE_ERROR err;
            bool haveSufficientBattery = true;
            uint32_t certBodyId = 0;

            TLVWriter *writer = aInParam.PrepareQuery_Metadata.MetaDataWriter;

            if (writer)
            {
                // Providing an installed Locale as MetaData is optional. The commented section below provides an example
                // of how one can be added to metadata.

                // TLVType arrayContainerType;
                // err = writer->StartContainer(ProfileTag(::nl::Weave::Profiles::kWeaveProfile_SWU, kTag_InstalledLocales), kTLVType_Array, arrayContainerType);
                // SuccessOrExit(err);
                // err = writer->PutString(AnonymousTag, installedLocale);
                // SuccessOrExit(err);
                // err = writer->EndContainer(arrayContainerType);

                err = writer->Put(ProfileTag(::nl::Weave::Profiles::kWeaveProfile_SWU, kTag_CertBodyId), certBodyId);
                APP_ERROR_CHECK(err);

                err = writer->PutBoolean(ProfileTag(::nl::Weave::Profiles::kWeaveProfile_SWU, kTag_SufficientBatterySWU), haveSufficientBattery);
                APP_ERROR_CHECK(err);
            }
            else
            {
                aOutParam.PrepareQuery_Metadata.Error = WEAVE_ERROR_INVALID_ARGUMENT;
                NRF_LOG_INFO("ERROR ! aOutParam.PrepareQuery_Metadata.MetaDataWriter is NULL");
            }
            break;
        }

        case SoftwareUpdateManager::kEvent_QueryPrepareFailed:
        {
            NRF_LOG_INFO("Software Update failed during prepare %d (%s) statusReport = %s", aInParam.QueryPrepareFailed.Error,
                                                                nl::ErrorStr(aInParam.QueryPrepareFailed.Error),
                                                                (aInParam.QueryPrepareFailed.StatusReport != NULL) ?
                                                                 nl::StatusReportStr(aInParam.QueryPrepareFailed.StatusReport->mProfileId,
                                                                                    aInParam.QueryPrepareFailed.StatusReport->mStatusCode) :
                                                                 "None");
            break;
        }

        case SoftwareUpdateManager::kEvent_SoftwareUpdateAvailable:
        {
            WEAVE_ERROR err;

            char currentFirmwareRev[ConfigurationManager::kMaxFirmwareRevisionLength+1] = {0};
            size_t currentFirmwareRevLen;
            err = ConfigurationMgr().GetFirmwareRevision(currentFirmwareRev, sizeof(currentFirmwareRev), currentFirmwareRevLen);
            APP_ERROR_CHECK(err);

            NRF_LOG_INFO("Current Firmware Version: %s", currentFirmwareRev);

            NRF_LOG_INFO("Software Update Available - Priority: %d Condition: %d Version: %s IntegrityType: %d URI: %s",
                                                                                aInParam.SoftwareUpdateAvailable.Priority,
                                                                                aInParam.SoftwareUpdateAvailable.Condition,
                                                                                aInParam.SoftwareUpdateAvailable.Version,
                                                                                aInParam.SoftwareUpdateAvailable.IntegrityType,
                                                                                aInParam.SoftwareUpdateAvailable.URI);

            break;
        }

