openweave/openweave-nrf52840-lock-example/main/AppTask.cpp
        case SoftwareUpdateManager::kEvent_FetchPartialImageInfo:
        {
            aOutParam.FetchPartialImageInfo.PartialImageLen = 0;
            break;
        }

        case SoftwareUpdateManager::kEvent_ClearImageFromStorage:
        {
            NRF_LOG_INFO("Clearing Image Storage");
            numBytesDownloaded = 0;
            break;
        }

        case SoftwareUpdateManager::kEvent_StartImageDownload:
        {
            sSHA256.Begin();
            NRF_LOG_INFO("Starting Image Download");
            break;
        }
        case SoftwareUpdateManager::kEvent_StoreImageBlock:
        {
            /* This example does not store image blocks in persistent storage and merely discards them after
             * computing the SHA over it. As a result, integrity has to be computed over image blocks rather than
             * the entire image. This pattern is NOT recommended since the computed integrity
             * will be lost if the device rebooted during download (unless also stored in persistent storage).
             */
            sSHA256.AddData(aInParam.StoreImageBlock.DataBlock, aInParam.StoreImageBlock.DataBlockLen);
            numBytesDownloaded += aInParam.StoreImageBlock.DataBlockLen;
            break;
        }

        case SoftwareUpdateManager::kEvent_ComputeImageIntegrity:
        {
            NRF_LOG_INFO("Num. bytes downloaded: %d", numBytesDownloaded);

            // Make sure that the buffer provided in the parameter is large enough.
            if (aInParam.ComputeImageIntegrity.IntegrityValueBufLen < sSHA256.kHashLength)
            {
                aOutParam.ComputeImageIntegrity.Error = WEAVE_ERROR_BUFFER_TOO_SMALL;
            }
            else
            {
                sSHA256.Finish(aInParam.ComputeImageIntegrity.IntegrityValueBuf);
            }
            break;
        }

        case SoftwareUpdateManager::kEvent_ReadyToInstall:
        {
            NRF_LOG_INFO("Image is ready to be installed");
            break;
        }

        case SoftwareUpdateManager::kEvent_StartInstallImage:
        {
            AppTask *_this = static_cast<AppTask*>(apAppState);

            NRF_LOG_INFO("Image Install is not supported in this example application");

            AppEvent event;
            event.Type             = AppEvent::kEventType_Install;
            event.Handler          = InstallEventHandler;
            _this->PostEvent(&event);

            break;
        }

        case SoftwareUpdateManager::kEvent_Finished:
        {
            if (aInParam.Finished.Error == WEAVE_ERROR_NO_SW_UPDATE_AVAILABLE)
            {
                NRF_LOG_INFO("No Software Update Available");
            }
            else if (aInParam.Finished.Error == WEAVE_DEVICE_ERROR_SOFTWARE_UPDATE_IGNORED)
            {
                NRF_LOG_INFO("Software Update Ignored by Application");
            }
            else if (aInParam.Finished.Error == WEAVE_DEVICE_ERROR_SOFTWARE_UPDATE_ABORTED)
            {
                NRF_LOG_INFO("Software Update Aborted by Application");
            }
            else if (aInParam.Finished.Error != WEAVE_NO_ERROR || aInParam.Finished.StatusReport != NULL)
            {
                NRF_LOG_INFO("Software Update failed %s statusReport = %s", nl::ErrorStr(aInParam.Finished.Error),
                                                                (aInParam.Finished.StatusReport != NULL) ?
                                                                 nl::StatusReportStr(aInParam.Finished.StatusReport->mProfileId,
                                                                                    aInParam.Finished.StatusReport->mStatusCode) :
                                                                 "None");
            }
            else
            {
                NRF_LOG_INFO("Software Update Completed");
            }
            break;
        }

        default:
            nl::Weave::DeviceLayer::SoftwareUpdateManager::DefaultEventHandler(apAppState, aEvent, aInParam, aOutParam);
            break;
    }
}
